Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_MCM.h
/*
** ###################################################################
**     Processors:          MIMXRT1165CVM5A_cm4
**                          MIMXRT1165CVM5A_cm7
**                          MIMXRT1165DVM6A_cm4
**                          MIMXRT1165DVM6A_cm7
**                          MIMXRT1165XVM5A_cm4
**                          MIMXRT1165XVM5A_cm7
**                          MIMXRT1166CVM5A_cm4
**                          MIMXRT1166CVM5A_cm7
**                          MIMXRT1166DVM6A_cm4
**                          MIMXRT1166DVM6A_cm7
**                          MIMXRT1166XVM5A_cm4
**                          MIMXRT1166XVM5A_cm7
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MCM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2020-12-29)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_MCM.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for MCM
 *
 * CMSIS Peripheral Access Layer for MCM
 */

#if !defined(PERI_MCM_H_)
#define PERI_MCM_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1165CVM5A_cm4) || defined(CPU_MIMXRT1165DVM6A_cm4) || defined(CPU_MIMXRT1165XVM5A_cm4))
#include "../MIMXRT1165_cm4_COMMON.h"
#elif (defined(CPU_MIMXRT1165CVM5A_cm7) || defined(CPU_MIMXRT1165DVM6A_cm7) || defined(CPU_MIMXRT1165XVM5A_cm7))
#include "../MIMXRT1165_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1166CVM5A_cm4) || defined(CPU_MIMXRT1166DVM6A_cm4) || defined(CPU_MIMXRT1166XVM5A_cm4))
#include "../MIMXRT1166_cm4_COMMON.h"
#elif (defined(CPU_MIMXRT1166CVM5A_cm7) || defined(CPU_MIMXRT1166DVM6A_cm7) || defined(CPU_MIMXRT1166XVM5A_cm7))
#include "../MIMXRT1166_cm7_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- MCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Peripheral_Access_Layer MCM Peripheral Access Layer
 * @{
 */

/** MCM - Size of Registers Arrays */
#define MCM_LMDR_COUNT                            4u

/** MCM - Register Layout Typedef */
typedef struct {
  __I  uint16_t PLREV;                             /**< SoC-defined platform revision, offset: 0x0, available only on: MCM (missing on CM7_MCM) */
  __I  uint16_t PCT;                               /**< Processor core type, offset: 0x2, available only on: MCM (missing on CM7_MCM) */
  __I  uint32_t MEMCFG;                            /**< Memory configuration, offset: 0x4, available only on: MCM (missing on CM7_MCM) */
  __I  uint16_t PLASC;                             /**< Crossbar Switch (AXBS) Slave Configuration, offset: 0x8, available only on: MCM (missing on CM7_MCM) */
  __I  uint16_t PLAMC;                             /**< Crossbar Switch (AXBS) Master Configuration, offset: 0xA, available only on: MCM (missing on CM7_MCM) */
  __IO uint32_t CR;                                /**< Control Register, offset: 0xC, available only on: MCM (missing on CM7_MCM) */
  __IO uint32_t ISCR;                              /**< Interrupt Status and Control Register, offset: 0x10 */
       uint8_t RESERVED_0[12];
  __I  uint32_t FADR;                              /**< Fault address register, offset: 0x20, available only on: MCM (missing on CM7_MCM) */
  __I  uint32_t FATR;                              /**< Fault attributes register, offset: 0x24, available only on: MCM (missing on CM7_MCM) */
  __I  uint32_t FDR;                               /**< Fault data register, offset: 0x28, available only on: MCM (missing on CM7_MCM) */
       uint8_t RESERVED_1[980];
  __IO uint32_t LMDR[MCM_LMDR_COUNT];              /**< Local Memory Descriptor Register, array offset: 0x400, array step: 0x4, available only on: MCM (missing on CM7_MCM) */
       uint8_t RESERVED_2[112];
  __IO uint32_t LMPECR;                            /**< LMEM Parity & ECC Control Register, offset: 0x480, available only on: MCM (missing on CM7_MCM) */
       uint8_t RESERVED_3[4];
  __IO uint32_t LMPEIR;                            /**< LMEM Parity & ECC Interrupt Register, offset: 0x488, available only on: MCM (missing on CM7_MCM) */
       uint8_t RESERVED_4[4];
  __I  uint32_t LMFAR;                             /**< LMEM Fault Address Register, offset: 0x490, available only on: MCM (missing on CM7_MCM) */
  __IO uint32_t LMFATR;                            /**< LMEM Fault Attribute Register, offset: 0x494, available only on: MCM (missing on CM7_MCM) */
       uint8_t RESERVED_5[8];
  __I  uint32_t LMFDHR;                            /**< LMEM Fault Data High Register, offset: 0x4A0, available only on: MCM (missing on CM7_MCM) */
  __I  uint32_t LMFDLR;                            /**< LMEM Fault Data Low Register, offset: 0x4A4, available only on: MCM (missing on CM7_MCM) */
} MCM_Type;

/* ----------------------------------------------------------------------------
   -- MCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Masks MCM Register Masks
 * @{
 */

/*! @name PLREV - SoC-defined platform revision */
/*! @{ */

#define MCM_PLREV_PLREV_MASK                     (0xFFFFU)
#define MCM_PLREV_PLREV_SHIFT                    (0U)
/*! PLREV - The PLREV[15:0] field is specified by an platform input signal to define a software-visible revision number. */
#define MCM_PLREV_PLREV(x)                       (((uint16_t)(((uint16_t)(x)) << MCM_PLREV_PLREV_SHIFT)) & MCM_PLREV_PLREV_MASK)
/*! @} */

/*! @name PCT - Processor core type */
/*! @{ */

#define MCM_PCT_PCT_MASK                         (0xFFFFU)
#define MCM_PCT_PCT_SHIFT                        (0U)
/*! PCT - This MCM design supports the ARM Cortex M4 core. The following value identifies this core complex.
 *  0b1010110001000000..ARM Cortex M4
 */
#define MCM_PCT_PCT(x)                           (((uint16_t)(((uint16_t)(x)) << MCM_PCT_PCT_SHIFT)) & MCM_PCT_PCT_MASK)
/*! @} */

/*! @name MEMCFG - Memory configuration */
/*! @{ */

#define MCM_MEMCFG_TCRAMUSZ_MASK                 (0x3CU)
#define MCM_MEMCFG_TCRAMUSZ_SHIFT                (2U)
/*! TCRAMUSZ - TCRAMU size */
#define MCM_MEMCFG_TCRAMUSZ(x)                   (((uint32_t)(((uint32_t)(x)) << MCM_MEMCFG_TCRAMUSZ_SHIFT)) & MCM_MEMCFG_TCRAMUSZ_MASK)

#define MCM_MEMCFG_TCRAMLSZ_MASK                 (0xF00U)
#define MCM_MEMCFG_TCRAMLSZ_SHIFT                (8U)
/*! TCRAMLSZ - TCRAML size */
#define MCM_MEMCFG_TCRAMLSZ(x)                   (((uint32_t)(((uint32_t)(x)) << MCM_MEMCFG_TCRAMLSZ_SHIFT)) & MCM_MEMCFG_TCRAMLSZ_MASK)
/*! @} */

/*! @name PLASC - Crossbar Switch (AXBS) Slave Configuration */
/*! @{ */

#define MCM_PLASC_ASC_MASK                       (0xFFU)
#define MCM_PLASC_ASC_SHIFT                      (0U)
/*! ASC - Each bit in the ASC field indicates whether there is a corresponding connection to the
 *    crossbar switch's slave input port.
 *  0b00000000..A bus slave connection to AXBS input port n is absent
 *  0b00000001..A bus slave connection to AXBS input port n is present
 */
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x)) << MCM_PLASC_ASC_SHIFT)) & MCM_PLASC_ASC_MASK)
/*! @} */

/*! @name PLAMC - Crossbar Switch (AXBS) Master Configuration */
/*! @{ */

#define MCM_PLAMC_AMC_MASK                       (0xFFU)
#define MCM_PLAMC_AMC_SHIFT                      (0U)
/*! AMC - Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.
 *  0b00000000..A bus master connection to AXBS input port n is absent
 *  0b00000001..A bus master connection to AXBS input port n is present
 */
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x)) << MCM_PLAMC_AMC_SHIFT)) & MCM_PLAMC_AMC_MASK)
/*! @} */

